OpenFOAM-v1812/tutorials/multiphase/icoReactingMultiPhaseInterFoam/inertMultiphaseMultiComponent/constant/thermophysicalProperties.oil
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       300.9;
    }
    equationOfState
    {
        rho             500;
    }
    thermodynamics
    {
        Cp              1670;
        Hf              0.0;
    }
    transport
    {
        mu              0.079;
        Pr              0.8;
    }
}

// ************************************************************************* //
